*** DONE 2.1.1 Validity of Arguments (9:38)
    CLOSED: [2015-03-09 Mon 10:54] SCHEDULED: <2015-03-09 Mon>
    պնդումների վավերականության մասին:
    ճշմարության աղյուսակների միջոցով վավերականության ստուգումը

    - պնդումը կապում է նախադրյալները(premises) եզրահանգմանը: Կան լավ և ոչ այնքան լավ պնդումներ:
      Տրամաբաններին հետաքրքրում է ինչով է պայմանավորված տարբերությունը:
    - պնդումը վավերական է եթե բոլոր նախադրյալները ճիշտ են ապա եզրահանգումը նույնպես ճիշտ է:
      Պնդում որոնք պարունկաում է A1, A2, ..., An նախադրյլանե և B եզրահանգումը մենք կգրենք
      A1, A2, ..., An |= B, պնդումը որ A1, A2, ..., An հետևում է B վավերական է: 
      arguemnt from premisies to conclusion B is valid.
    - օրինակ.
     A1 = (p&~q)->r
     A2 = ~r
     B = p->q
     ---------
      պետք է ստուգենք A1, A2 |= B պնդման վավերականությունը

      | # | p | q | r | (p&~q)->r | ~r | p -> q |   |
      |---+---+---+---+-----------+----+--------+---|
      | 1 | 0 | 0 | 0 |         1 |  1 |      1 | + |
      | 2 | 0 | 0 | 1 |         1 |  0 |      1 |   |
      | 3 | 0 | 1 | 0 |         1 |  1 |      1 | + |
      | 4 | 0 | 1 | 1 |         1 |  0 |      1 |   |
      | 5 | 1 | 0 | 0 |         0 |  1 |      0 |   |
      | 6 | 1 | 0 | 1 |         1 |  0 |      0 |   |
      | 7 | 1 | 1 | 0 |         1 |  1 |      1 | + |
      | 8 | 1 | 1 | 1 |         1 |  0 |      1 |   |
      |---+---+---+---+-----------+----+--------+---|
      #+TBLFM: $1=vlen(@I$1..0);EN

      վավերականություն հաստատելու համար պետք է նաենք այն տողերը որտեղ 
      A1 և A2 նախադրյալները ընդունում են ճշմարիտ արժեք. 1-ին, 3-րդ և 7-րդ տողերը
      և համոզվենք որ համապատասխան տողերում եզրահանգումը նույնպես ընդունում է 
      ճշմարիտ արժեք, հետևաբար վավերական է մեր պնդումը:





*** DONE 3.4 Minimizing Logic Circuits Using K-Maps (26:40)
    CLOSED: [2015-03-18 Wed 09:15] SCHEDULED: <2015-03-17 Tue>
    CLOCK: [2015-03-18 Wed 07:16]--[2015-03-18 Wed 09:13] =>  1:57
    :PROPERTIES:
    :Effort:   26:40
    :END:
    Karnaugh map method is a systematic method for deriving a minimal DNF from the
    truth table for a propositional logic formula or combinational system.
